app/controllers/accounts_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 10) LIMIT 1
---
  def index
    @accounts = Account.user_only(@current_user.id).find(:all)