app/controllers/accounts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def delete_log

  	@account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def month_pocket_journal
  	@account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 89)
---
  def month_pocket_totals

  	@account = Account.find(params[:id])

SELECT * FROM "pockets"
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def set_filtered_transactions
  	if params[:filter_commit].eql?('update')
  		reselect_filters
  	end
  	p session[:selector].selectedPockets
  	@account = Account.find(params[:id])