app/controllers/contracts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def index

    @contracts = Contract.activeContracts(@current_user.id)
  	@account = Account.find(params[:account_id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def new
  	@contract = Contract.new
  	@contract.date_start = Date.today
  	@contract.date_end = Date.today >> 12
  	@contract.full_date = Date.today
  	@account = Account.find(params[:account_id])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 91)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
DELETE FROM "contracts" WHERE "id" = 91
---
 def destroy
    @contract = Contract.find(params[:id])
	@account = Account.find(params[:account_id])
    @contract.destroy