app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.user_only(@current_user.id).find(:all)
---
SELECT * FROM "contracts" WHERE ("contracts"."user_id" = 10)
SELECT * FROM "users" WHERE ("users"."id" = 10) LIMIT 1