app/controllers/rules_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def index
	@account = Account.find(params[:account_id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def new
    @rule = Rule.new
	@account = Account.find(params[:account_id])

SELECT * FROM "rules" WHERE ("rules"."id" = 47)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
---
  def edit
    @rule = Rule.find(params[:id])
	@account = Account.find(params[:account_id])