app/controllers/stateli_controller.rb

SELECT * FROM "accounts" WHERE (("accounts"."user_id" = 1 AND "accounts"."active" = 't')) AND ( ("accounts"."type" = 'AccountDebit' ) )
---
  def account_listing
    @accountsDebit = AccountDebit.activeAccounts(@current_user.id)
    logger.info "#{@accountsDebit.size} Debit Accounts"

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
---
  def account_pending
  	@account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
---
   def account_journal
  	@account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE (("accounts"."user_id" = 1 AND "accounts"."active" = 't')) AND ( ("accounts"."type" = 'AccountDebit' ) )
SELECT * FROM "transactions" WHERE ((account_id_dest = 56 or account_id_source = 56) AND (completed = 't')) ORDER BY executed_date ASC
SELECT count(*) AS count_all FROM "transactions" WHERE (((scheduled_date < '2009-08-14') AND (completed = 'f')) AND (account_id_source = 56 and type = 'TransactionCredit'))
---
  def account_journal_flex

  	accountsDebit = AccountDebit.activeAccounts(@current_user.id)
    logger.info "#{accountsDebit.size} Debit Accounts"

	@start_date = params[:start_date]
  	if @start_date.nil?
  		@start_date = Date.today >> -12
  	end
  	@end_date = params[:end_date]
  	if @end_date.nil?
  		@end_date = Date.today
  	end

	debit_account_array = [];
  	accountsDebit.each do |acc|
  		transactions = acc.completed_transactions
  		logger.info "#{transactions.size} Transactions"

SELECT * FROM "accounts" WHERE (("accounts"."user_id" = 1 AND "accounts"."active" = 't')) AND ( ("accounts"."type" = 'AccountDebit' ) )
---
  def account_pending_flex

  	accountsDebit = AccountDebit.activeAccounts(@current_user.id)
    logger.info "#{accountsDebit.size} Debit Accounts"

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
---
  def account_deposit
  	@account = Account.find(params[:id])

INSERT INTO "accounts" ("name", "created_at", "updated_at", "type", "user_id", "description", "balance", "active") VALUES('dfadfa', '2009-10-18 09:37:52', '2009-10-18 09:37:52', 'AccountDebit', 1, 'dfadfa', 4342.0, 't')
---
  def account_create_account
  	accountType = params[:account][:type]
	if accountType == 'AccountDebit'
		 @account = AccountDebit.new(params[:account])
	elsif accountType == 'AccountCredit'
		 @account = AccountCredit.new(params[:account])
	end

	@account.user_id = @current_user.id

    respond_to do |format|
    	logger.info "FORMAT: #{format}"
      if @account.save

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
---
  def account_edit
    @account = Account.find(params[:account_id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
UPDATE "accounts" SET "updated_at" = '2009-10-14 16:00:24', "name" = 'WAMU Checkings' WHERE "id" = 56
---
  def account_update
  	@account = Account.find(params[:account_id])
	@account.user_id = @current_user.id

	@start_date = params[:start_date]
  	if @start_date.nil?
  		@start_date = Date.today >> -12
  	end
  	@end_date = params[:end_date]
  	if @end_date.nil?
  		@end_date = Date.today
  	end


    respond_to do |format|
      if @account.update_attributes(params[:account])

SELECT * FROM "transactions" WHERE ("transactions"."id" = 117576)
UPDATE "transactions" SET "updated_at" = '2009-10-18 20:35:54', "completed" = 't', "executed_date" = '2009-10-01' WHERE "id" = 117576
UPDATE "accounts" SET "updated_at" = '2009-10-18 20:35:54', "balance" = 16501.42 WHERE "id" = 56
---
  def autopay

    @transaction = Transaction.find(params[:transaction_id])
    @transaction.executed_date = @transaction.scheduled_date
    @transaction.completed = true

    @account_changed = false

    respond_to do |format|
      if @transaction.save

      	if(@transaction.type == 'TransactionCredit')
      		@account = @transaction.sourceAccount
  		elsif(@transaction.type == 'TransactionDebit')
  			@account = @transaction.destinationAccount
  		end

      	@account.updateBalance(@transaction)

INSERT INTO "contracts" ("name", "full_date", "created_at", "updated_at", "amount", "autopay", "day_of_month_alt", "transaction_type", "type", "user_id", "day_of_month", "description", "date_start", "date_end", "autopay_account_id", "weekday", "active") VALUES('mortgage', '2009-10-18', '2009-10-18 09:57:34', '2009-10-18 09:57:34', 2678.34, 't', 1, 'TransactionCredit', 'ContractMonthly', 1, 1, 'Mortgage Payment', '2009-10-18', '2009-10-18', 56, 0, 't')
INSERT INTO "transactions" ("name", "executed_date", "created_at", "scheduled_date", "completed", "updated_at", "amount", "account_id_source", "autopay", "type", "user_id", "description", "account_id_dest", "contract_id") VALUES('Another Monthly Contract Contract Transaction', NULL, '2009-10-18 11:09:01', '2009-10-18', 'f', '2009-10-18 11:09:01', 1111.0, 59, 't', 'TransactionCredit', 8, 'afadfa Contract Transaction', NULL, 52)
---
  def build_contract_credit

  	logger.info "BUILDING CREDIT CONTRACT"
	@contract = build_new_contract
	@contract.transaction_type = 'TransactionCredit'

    respond_to do |format|
      if @contract.save

INSERT INTO "contracts" ("name", "full_date", "created_at", "updated_at", "amount", "autopay", "day_of_month_alt", "transaction_type", "type", "user_id", "day_of_month", "description", "date_start", "date_end", "autopay_account_id", "weekday", "active") VALUES('L5M', '2009-10-18', '2009-10-18 10:11:42', '2009-10-18 10:11:42', 3672.34, 't', 15, 'TransactionDebit', 'ContractBimonthly', 8, 1, 'L5M Direct Deposit', '2009-10-18', '2009-10-18', 56, 0, 't')
---
  def build_contract_debit

  	logger.info "BUILDING DEBIT CONTRACT"
	@contract = build_new_contract
	@contract.transaction_type = 'TransactionDebit'

    respond_to do |format|
      if @contract.save

SELECT * FROM "transactions" WHERE ("transactions"."id" = 117740)
---
  def transaction_do
    @transaction = Transaction.find(params[:transaction_id])

SELECT * FROM "transactions" WHERE ("transactions"."id" = 117740)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
UPDATE "transactions" SET "updated_at" = '2009-10-19 01:05:06', "account_id_source" = 56, "completed" = 't', "executed_date" = '2009-10-18' WHERE "id" = 117740
UPDATE "accounts" SET "updated_at" = '2009-10-19 01:05:06', "balance" = 16258.42 WHERE "id" = 56
---
  def transaction_complete
    @transaction = Transaction.find(params[:transaction_id])
	@transaction.user_id = @current_user.id
	@transaction.executed_date = Date.today
	@transaction.completed = true;

	if @transaction.type == 'TransactionCredit'
		@account = Account.find(params[:transaction][:account_id_source])
	elsif @transaction.type == 'TransactionDebit'
		@account = Account.find(params[:transaction][:account_id_dest])
	end

    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])

      	@account.updateBalance(@transaction)

SELECT * FROM "transactions" WHERE ("transactions"."id" = 117576)
---
  def transaction_details
    @transaction = Transaction.find(params[:id])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 46)
---
  def contract_details
    @contract = Contract.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 56)
---
  def account_details
    @account = Account.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '6a23ed39b449696321b8098ba6ce8345b9ef8b70', '2009-10-18 10:09:06', 'c75e003f4f514ed46b5a333ba16c6cc091327958', NULL, '2009-10-18 10:09:06', NULL, 'guest', 'guest1026@gmail.com')
---
  def register
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save