app/controllers/transactions_controller.rb

SELECT * FROM "transactions" WHERE ("transactions"."user_id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @transactions = Transaction.user_only(@current_user.id).find(:all)