app/controllers/transactions_controller.rb

  def restore_checked

  	params[:transactions].each do |trans_id, value|
  		transaction = Transaction.find(trans_id)
  		transaction.activate
  	end

  	@account = Account.find(params[:account_id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 122778)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)

  def edit
    @transaction = Transaction.find(params[:id])
    @account = Account.find(params[:account_id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 123116)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)

  def update

  	@transaction = Transaction.find(params[:id])
    @account = Account.find(params[:account_id])
    params[:transaction][:pocket_id] = params[:prefix][:pocket_id]
    respond_to do |format|
      if params[:edit_commit].eql?('update')
      	success = @transaction.update_transaction_attributes(params[:transaction])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 123116)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 79)
UPDATE "transactions" SET "updated_at" = '2010-09-07 12:44:35', "pocket_id" = 8 WHERE "id" = 123116